// МІНІМУМ
// Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
/*let num1 = 0.1
let num2 = 0.2
let result = (num1 + num2).toFixed(1)
alert (result)*/

/*Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних),
добийся математично правильної відповіді.*/
/*let str = '1'
let num2 = 2
let num1 = Number(str);
alert(num1 + num2)*/

/*Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром
в 820 Мб поміщається на флешку.*/
/*let driveSize = 1000
let fileSize = 820
let result = (driveSize / fileSize)
alert (Math.round(result))*/

    // НОРМА
/*Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити
користувач і скільки здачі у нього залишиться.*/
/*
let money = prompt('Скільки грошей(грн) у вашому гаманці:');
let price = prompt('Введіть ціну(грн) шоколадки, яку хочете придбати:');
let moneyLeft = (money % price)
let amountOfChocolates = Math.round(money / price)
alert(`Ви можете придбати ${amountOfChocolates} шокоомноном. В гаманці лишиться ${moneyLeft} грн, отакої...`);
*/

    /*Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться
оператор % (залишок від ділення).*/
/*
let num = prompt('Вкажіть трьозначне число:');

function getReversedNum(num) {
    let result = 0;
    while (num) {
        result = result * 10 + num % 10;
        num = Math.floor(num / 10);
    }

    return result;
}

alert(getReversedNum(num));
*/


// МАКСИМУМ
/*Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних.
    Вивести суму нарахованих відсотків.
    Розв'язання:
Для розрахунку майбутньої вартості депозиту за умови нарахування простих відсотків використовуємо
формулу: S = P × (1 + і*n)
Процентний прибуток вкладника дорівнює: S - P
*/
/*let p = prompt('Введіть суму вкладу в банк:')
const n = 2 / 12
const i = 5 / 100
let s = p * (1 + (i * n))
    let result = (s - p).toFixed(2);
alert(`Ваша сума нарахованих відсотків складе ${result} грн. Щоб збільшити свій прибуток,
радимо потримати гроші в нашому банку подовше.`);*/



    // Що повернуть вираження:
/*
console.log(2 && 0 && 3) - 0 (бо тут все 'і', а значить якщо хоча б одне значення false, то видасть false, тобто 0)

console.log(2 || 0 || 3) - 2 (оператор 'або' обчислює рівно стільки значень, скільки необхідно до першого true.
Тут по черзі перше значення true є 2, отож воно на виході.)

console.log(2 && 0 || 3) - 3 (тут спершу обробиться 'і', яке видасть false, потім значення 'або', і там значення true
є 3, отож на виході 3)*/
